Revit 2024 API
LineLoadType Class
 LineLoadType class
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class LineLoadType : LoadTypeBase
Visual Basic
Public Class LineLoadType _
	Inherits LoadTypeBase
Visual C++
public ref class LineLoadType : public LoadTypeBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Structure.LoadTypeBase
 Autodesk.Revit.DB.Structure.LineLoadType
See Also
LineLoadType Members
Autodesk.Revit.DB.Structure Namespace